#define _CRT_SECURE_NO_WARNINGS
#include "tree.h"
int flag1 = 0;
int flag2 = 0;
int main()
{
	char str[256];
	char toks[10][16];
	int n_toks;
	node root;
	FILE* fp = fopen("조선왕조.txt", "r+t");
	root.init();
	while (fgets(str, 256, fp) != NULL) {
		n_toks = parse_str(toks, str);
		root.insert(n_toks, toks);
	}
	printf("========================================================\n");
	printf("============조선의 왕을 순서대로 출력하시오.============\n");
	printf("========================================================\n");
	root.traverse();
	printf("\n");

	printf("========================================================\n");
	printf("============조선의 왕을 역순으로 출력하시오.============\n");
	printf("========================================================\n");
	root.Rtraverse();
	printf("\n");

	printf("========================================================\n");
	printf("===============조선의 왕은 모두 몇 명인가?==============\n");
	printf("========================================================\n");
	printf("%d명\n", root.countKings());
	printf("\n");

	printf("========================================================\n");
	printf("=====조선의 왕 중에서 인조의 후손은 누구누구인가?=======\n");
	printf("========================================================\n");
	root.print_descents("인조", 0);
	printf("\n");

	printf("========================================================\n");
	printf("=====직계 후손이 왕이 되지 못한 왕은 누구누구인가?======\n");
	printf("========================================================\n");
	root.print_no_descents();
	printf("\n");

	printf("========================================================\n");
	printf("===직계 후손이 왕이 된 수가 가장 많은 왕은 누구인가?====\n");
	printf("========================================================\n");
	root.print_max_descents();
	printf("\n");

	printf("========================================================\n");
	printf("=====정종의 형제로 조선의 왕이 된 사람은 누구인가?======\n");
	printf("========================================================\n");
	root.siblings("정종");
	printf("\n");

	printf("========================================================\n");
	printf("==========순종의 직계 선조를 모두 출력하시오.===========\n");
	printf("========================================================\n");
	root.ancestor("순종", 0);
	printf("\n");

	printf("========================================================\n");
	printf("======직계 후손이 2명 이상 왕이 된 왕은 몇 명인가?======\n");
	printf("========================================================\n");
	printf("%d명\n", root.count_n_descents(2));
	printf("\n");

	printf("========================================================\n");
	printf("==============예종은 태종의 몇 대 후손인가?=============\n");
	printf("========================================================\n");
	printf("%d대\n", root.count_depth("태종", "예종", 0));
	printf("\n");
	fclose(fp);
	system("pause");
	return 0;
}